// System.Console.WriteLine("Введите число квадрат которого вы хотите увидеть ->");
// int num = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine($"Квадрат числа {num} -> {num*num}");


// Task2.
// 5 25 - ?
// 25 5 - ?

// System.Console.WriteLine("Введите первое число -> ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine("Введите второе число -> ");
// int num2 = Convert.ToInt32(Console.ReadLine());

// int quad = num2 * num2;



// if(num1 == quad)
// {
//     System.Console.WriteLine($"Первое чило {num1} является квадратом второго числа {num2}");
// }
// else
// {
//   System.Console.WriteLine($"Первое чило {num1} не является квадратом второго числа {num2}");
// }


//Task3
// Написать программу которая принимает число N и выводит последовательность чисел от - N до N

// System.Console.WriteLine("Введите число N -> ");
// int n = Convert.ToInt32(Console.ReadLine() );

// int current = n* (-1);

// while (current <= n)
// {
// System.Console.Write(current + " ");
// current ++;
// }


//Task4

// Дается 3х значное число. Нам нужно вывести последнею цифру этого числа

// System.Console.WriteLine("Введите трехзначное  число");
// int n = Convert.ToInt32(Console.ReadLine() );

// if ( n >= 100 && n <= 999 )

// {
//    System.Console.WriteLine($"Последняя цифра числа {n} -> {n % 10} ");
// }
// else
// {
// System.Console.WriteLine("Вы ввели не трехзначное число!");
// } 



//HomeWork

// Quests 2
// Дается два числа и надо понять , какое из чисел больше

// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3


// int max = 0;
// int min = 0;

// Console.Write("Введите первое число: ");
// int firstNumber = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите второе число: ");
// int secondNumber = Convert.ToInt32(Console.ReadLine());

// if(firstNumber > secondNumber)
// {
//     max = firstNumber;
//     min = secondNumber;
// }
// else
// {
//     max = secondNumber;
//     min = firstNumber;
// }
// Console.WriteLine("max = " + max + " и " + "min = " + min);

//Quests 4
// Дается 3 числа и надо выбрать максимальное число

//2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// int  max = 0; 

// Console.WriteLine ("Введите первое число");
// int firstNumber = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine ("Введите второе число");
// int secondNumber = Convert.ToInt32(Console.ReadLine());
 
// Console.WriteLine ("Введите третье число");
// int thirdNumber = Convert.ToInt32(Console.ReadLine());

// if (firstNumber > max);

// {
//    max = firstNumber ;
// }

// {
//    max = secondNumber ; 

// }

// {
//    max = thirdNumber ;
// }
// Console.WriteLine ($"max = " + max );


//Quest 6 
// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка)
//4 -> да
// -3 -> нет
// 7 -> нет
// System.Console.WriteLine("Введите число");
//  int n = Convert.ToInt32(Console.ReadLine() );

// int Remdiv = n % 2;

// if(Remdiv == 0) 

// {
//     System.Console.WriteLine("Да");
// }
// else
// {
//     System.Console.WriteLine("Нет");
// }

// А вот 8 я хрен знает, голова и так сломана, когда будем веб сайты писать??? :)


